package top.geomatics.gazetteer.utilities.address;

import java.util.HashMap;
import java.util.Map;

/**
 * <em>别名</em><br>
 * 
 * @author yupeiyu
 *
 */
public interface Alias {

	public static final String[] WORDS_ARRAY = { "粤=广东省", "南粤=广东省", "鹏城=深圳", "路=大道", "小区=社区", "设计之都=深圳", "时尚之城=深圳",
			"创客之城=深圳", "志愿者之城=深圳", "弄堂=街道", "胡同=街道", "街巷=街道", "桔新徽商北区大楼=龙华区福城街道观光路北侧", "桔新徽商南区大楼=龙华区福城街道观光路北侧",
			"深国际华南物流中心=民治办事处", "思创科技生产厂区=观湖办事处", "东方龙公馆=大浪办事处", "建发玺园=福城办事处", "通达汇轩=龙华办事处", "华盛珑悦花园=民治办事处",
			"安宏基天曜广场=民治办事处", "优鼎厂区=龙华办事处", "华侨城创想大厦=民治办事处", "同创华著公馆=民治办事处", "祥瑞金茂府=民治办事处,壹城超体花园=龙华办事处", "银星智谷厂区=观澜办事处",
			"中森公园华府=观澜办事处", "鸿发路=龙华街道鸿盛路南面工业西路北", "白松二路=民治街道民塘路西面新通路东面", "白松一路=民治街道民宝路东面新通路西面",
			"横坑车辆场=观湖街道人民路与安远路交汇东北侧", "观澜体育公园=福城街道观光路与福园路交汇处东南侧", "观城站天桥=观澜街道观澜人民路和环观中路交叉口", "梅龙北站天桥=龙华街道梅龙路与大和路交叉口",
			"清湖学校站天桥=龙华街道梅龙路与清华东路交叉口", "河西站天桥=观澜街道", "龙华区实验学校人行天桥=民治街道人民路与绿景路交叉口处", "龙塘社区公园=民治街道新区大道西面洁玉路北面",
			"胜华社区公园=大浪街道和平路北面工业西路西面", "龙塘居=民治街道腾龙路东面佳民路南面", "深圳市龙华区人民医院新外科大楼=龙华街道建设东路和东环二路交汇处西北侧",
			"福水路=福城街道新丹路南面、观兴东路西面", "翔龙路=民治街道南起新区大道、北起白石龙一街", "皇嘉珑府=龙华区民治街道民塘路与宁远路交汇处东南侧", "尚峻御园=大浪办事处", "融创智汇大厦=民治办事处",
			"万福花园=民治办事处", "诗恩时尚创意产区=大浪办事处", "龙华镇=龙华区", "宝安县=深圳", "香山县=深圳", "新安县=深圳" };
	public static final Map<String, String> WORDS_MAP = new HashMap<String, String>() {

		/**
		 * 
		 */
		private static final long serialVersionUID = 3674484656034194962L;
		{
			for (int i = 0; i < WORDS_ARRAY.length; i++) {
				String wordString = WORDS_ARRAY[i].trim();
				String words[] = wordString.split("=");
				if (2 != words.length) {
					continue;
				}
				put(words[0], words[1]);
			}
		}

	};
}