/**
 * 
 */
package top.geomatics.gazetteer.utilities.address;

import java.util.ArrayList;
import java.util.List;

/**
 * <em>搜索敏感词</em>
 * 
 * @author whudyj
 *
 */
public interface ISensitiveWords {
	public static final String[] WORDS_ARRAY = { "抗疲劳", "不伤眼", "不疲劳", "不会疲劳", "延年益寿", "明目", "治疗近视", "预防近视", "防近视",
			"保护眼睛", "保护视力", "护目", "护眼", "新低", "必备", "底价", "抄底", "全能", "质量免检", "国家领导人", "最大程度", "首个", "最高级", "首家", "最便宜",
			"唯一", "顶级", "最先进", "着名", "独家", "绝对", "最新技术", "国家级", "最佳", "销量第一", "红十字", "天安门", "国歌", "国徽", "国旗", "国宴",
			"中南海", "国务院", "军需特供", "军队特供", "人民大会堂特供", "人民大会堂专用", "免抽检", "无需国家质量检测", "中国驰名商标", "中国免检商品", "消费者首选品牌",
			"央视展播品牌", "cctv展播品牌", "cctv上榜品牌", "央视上榜品牌", "上榜品牌", "展播品牌", "市场占有率第一", "全国销量第一", "占有率第一", "第一名", "领导人推荐",
			"巨星", "最底", "极品", "顶级享受", "全球首发", "第一品牌", "最赚", "最先", "至尊", "奢侈", "超赚	", "最先进科学", "填补国内空白", "最好", "治疗",
			"根治", "医疗", "医治", "疗效", "治愈", "极致", "抗辐射", "速效", "奇效", "延缓衰老", "保健", "强效", "防辐射", "顶尖", "极佳", "绝佳", "最优",
			"最新", "名牌", "优秀", "独有", "独创", "一切", "首款", "屌炸天", "屌丝", "撕逼", "打飞机", "色诱", "妖怪", "全网", "逼格", "首创", "首选",
			"百分百", "国际知名", "最强", "王牌", "掌门人", "领袖品牌", "独一无二", "绝无仅有", "前无古人", "史无前例", "万能", "top1", "销量冠军", "终极", "最大",
			"最极致", "最棒", "最长", "最短", "最宽", "最窄", "最坚固", "最小巧", "最灵敏", "最完美", "完美", "独具", "首种", "首类", "国际级", "国际", "之王",
			"之最", "免检", "着名品牌", "质量无须检测", "国家领导人推荐", "国家机关推荐", "国家机关专供", "国家机关特供", "逗比", "逗逼", "共产党", "中纪委", "共产主义",
			"毛主席", "革命", "习大大", "蛮夷", "日本鬼子", "战斗民族", "印度阿三", "佛祖", "上帝", "真主", "绿茶婊", "权势狗", "最薄", "最美", "国宝级", "宇宙级",
			"领先", "领跑", "免检产品", "冠军", "最超值", "全网最", "级牛", "世界上最", "全球品质", "神款", "全网唯一", "最尖端", "最逼真", "全中国最新款", "全网最全",
			"领导品牌", "中华民国", "解放前", "台独 ", "台湾地区的法律", "大陆法律", "台湾行政院", "台湾各部门", "中华民国部门", "台湾", "马英九总统", "台湾官员",
			"港澳台游客来华旅游", "台联党", "台北故宫", "台湾清华大学", "国立台湾大学", "台北国父纪念馆", "台湾护照", "偷渡台湾", "中台合资", "中港", "中台", "中澳",
			"1949年以后台湾与大陆分治", "Mainland China", "Mainland Mandarin", "Life in 31 countries",
			"Journal of National Taipei College of Business", "新台币", "蒙族", "蒙古大夫", "藏区", "藏民", "哈萨族", "回回", "蛮子", "维族",
			"高丽", "蒙古人民共和国", "北朝鲜", "North Korea", "南朝鲜", "汉城", "穆斯林国家", "基地组织", "伊斯兰极端主义", "黑非洲", "世界贸易组织成员国",
			"亚太经合组织成员国", "毛泽东主义", "毛泽东主义时代", "文化大革命", "十年动乱", "四人帮", "大跃进", "黑五类", "群专办", "文宣队", "日清战争", "十字军东征" };
	public static final List<String> WORDS_LIST = new ArrayList<String>() {
		/**
		 * 
		 */
		private static final long serialVersionUID = 1L;
		{
			for (int i = 0; i < WORDS_ARRAY.length; i++) {
				add(WORDS_ARRAY[i].trim());
			}
		}

	};

}
